tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "ansible"
brew "bat"
brew "coreutils"
brew "docker"
brew "duf"
brew "exa"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lima"
brew "neovim"
brew "pre-commit"
brew "python@3.10"
brew "ripgrep"
brew "starship"
brew "tailscale"
brew "terraform"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "barrier", args: { appdir: "/Applications" }
cask "calibre", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-fira-code", args: { appdir: "/Applications" }
cask "font-hack", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "kitty", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "powershell", args: { appdir: "/Applications" }
cask "rectangle", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
