tap "derailed/popeye"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kubefirst/tools"
tap "nikitabobko/tap"
brew "age"
brew "openssl@3"
brew "python-markupsafe"
brew "ansible"
brew "argocd"
brew "argocd-autopilot"
brew "python@3.11"
brew "azure-cli"
brew "libssh2"
brew "bat"
brew "coreutils"
brew "cask"
brew "docker"
brew "duf"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gping"
brew "handbrake"
brew "helm"
brew "htop"
brew "hugo"
brew "jq"
brew "k9s"
brew "kubefirst"
brew "kubernetes-cli"
brew "qemu"
brew "lima"
brew "lua"
brew "luacheck"
brew "luarocks"
brew "node"
brew "markdownlint-cli"
brew "openjdk"
brew "maven"
brew "minikube"
brew "mkcert"
brew "neofetch"
brew "neovim"
brew "nss"
brew "podman"
brew "virtualenv", link: false
brew "pre-commit"
brew "proselint"
brew "python@3.10"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "sops"
brew "starship"
brew "tailscale", restart_service: true
brew "terraform"
brew "tree"
brew "vhs"
brew "wget"
brew "youtube-dl"
brew "yt-dlp"
brew "zk"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "derailed/popeye/popeye"
cask "aerospace"
cask "anki"
cask "barrier", args: { appdir: "/Applications" }
cask "calibre", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-fira-code", args: { appdir: "/Applications" }
cask "font-fira-code-nerd-font"
cask "font-hack", args: { appdir: "/Applications" }
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome", args: { appdir: "/Applications" }
cask "kitty", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "powershell", args: { appdir: "/Applications" }
cask "rectangle", args: { appdir: "/Applications" }
cask "seafile-client"
cask "shortcat"
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "wezterm"
cask "zoom", args: { appdir: "/Applications" }
vscode "aaron-bond.better-comments"
vscode "benjaminbenais.copilot-theme"
vscode "DavidAnson.vscode-markdownlint"
vscode "dendron.dendron"
vscode "dendron.dendron-markdown-preview-enhanced"
vscode "dendron.dendron-markdown-shortcuts"
vscode "dendron.dendron-paste-image"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "KevinRose.vsc-python-indent"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "neverik.go-critic"
vscode "njpwerner.autodocstring"
vscode "PenumbraTheme.penumbra"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "sainnhe.everforest"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
